Revit 2024 API
BuiltInFailures.AlignmentFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.AlignmentFailures type exposes the following members.
Properties
Name | Description
AlignmentCheckStationLabels
 A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels. Please check the labels to ensure proper placement.
See Also
BuiltInFailures.AlignmentFailures Class
Autodesk.Revit.DB Namespace